In [29]:
dict_file = [{"name": "jake", "age":30, "M": True, "Sex": "ml", "salary":5000},
            {"name": "fani", "age":28, "M": True, "Sex": "ml", "salary":2000}, 
            {"name": "beeniel", "age":25, "M": True, "Sex": "fl", "salary":2500},
            {"name": "susan", "age":21, "M": False,"Sex": "fl", "salary": 3500 }
            ]
print(dict_file)
print(type(dict_file))

[{'name': 'jake', 'age': 30, 'M': True, 'Sex': 'ml', 'salary': 5000}, {'name': 'fani', 'age': 28, 'M': True, 'Sex': 'ml', 'salary': 2000}, {'name': 'beeniel', 'age': 25, 'M': True, 'Sex': 'fl', 'salary': 2500}, {'name': 'susan', 'age': 21, 'M': False, 'Sex': 'fl', 'salary': 3500}]
<class 'list'>

In [30]:
import pandas as pd
t_df = pd.DataFrame(dict_file)
t_df

      name  age      M Sex  salary
0     jake   30   True  ml    5000
1     fani   28   True  ml    2000
2  beeniel   25   True  fl    2500
3    susan   21  False  fl    3500

In [31]:

new_file = []
for i in dict_file:
    for a, b in i.items():
        if a == 'M' and b == True:
            new_file.append(i) 
print(new_file)

[{'name': 'jake', 'age': 30, 'M': True, 'Sex': 'ml', 'salary': 5000}, {'name': 'fani', 'age': 28, 'M': True, 'Sex': 'ml', 'salary': 2000}, {'name': 'beeniel', 'age': 25, 'M': True, 'Sex': 'fl', 'salary': 2500}]

In [32]:
A_ans =[]
for j in new_file:
    for c, d in j.items():
        if c == "age" and d >= 25 and d <= 30:
            j["salary"] = j["salary"] * 1.05
            A_ans.append(j)
print(A_ans)

[{'name': 'jake', 'age': 30, 'M': True, 'Sex': 'ml', 'salary': 5250.0}, {'name': 'fani', 'age': 28, 'M': True, 'Sex': 'ml', 'salary': 2100.0}, {'name': 'beeniel', 'age': 25, 'M': True, 'Sex': 'fl', 'salary': 2625.0}]

In [33]:
A_df = pd.DataFrame(A_ans)
A_df

      name  age     M Sex  salary
0     jake   30  True  ml  5250.0
1     fani   28  True  ml  2100.0
2  beeniel   25  True  fl  2625.0

In [42]:
B_ans = []
for k in new_file:
    for e, f in k.items():
        if e == "Sex" and f == "ml":
            B_ans.append(k)
print(B_ans)

[{'name': 'jake', 'age': 30, 'M': True, 'Sex': 'ml', 'salary': 5250.0}, {'name': 'fani', 'age': 28, 'M': True, 'Sex': 'ml', 'salary': 2100.0}]